tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'teamookla/speedtest'

brew 'asdf'
brew 'automake'
brew 'awscli'
brew 'azure-cli'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'csvkit'
brew 'ctags'
brew 'curl'
brew 'direnv'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'glab'
brew 'gpg'
brew 'helm'
brew 'highlight'
brew 'htop'
brew 'java'
brew 'jq'
brew 'neovim'
brew 'netcat'
brew 'nginx'
brew 'openssl'
brew 'prettyping'
brew 'pstree'
brew 'python-yq'
brew 'shellcheck'
brew 'skaffold'
brew 'socat'
brew 'speedtest-cli'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tree'
brew 'watch'
brew 'yamlfmt'
brew 'yamllint'
brew 'yt-dlp'
brew 'zsh'

cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'butler'
cask 'caffeine'
cask 'charles'
cask 'chromium', args: { no_quarantine: true }
cask 'docker'
cask 'dropbox'
cask 'expressvpn'
cask 'handbrake'
cask 'intellij-idea'
cask 'iterm2'
cask 'itsycal'
cask 'karabiner-elements'
cask 'little-snitch'
cask 'loopback'
cask 'macdown'
cask 'mactracker'
cask 'monolingual'
cask 'netspot'
cask 'omnidisksweeper'
cask 'omnifocus'
cask 'omnigraffle'
cask 'rapidapi'
cask 'rectangle'
cask 'slack'
cask 'steam'
cask 'tidal'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'
cask 'witch'
