tap 'carvel-dev/carvel'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'automake'
brew 'awscli'
brew 'azure-cli'
brew 'cmake'
brew 'coreutils'
brew 'csvkit'
brew 'ctags'
brew 'curl'
brew 'direnv'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'glab'
brew 'gpg'
brew 'helm'
brew 'highlight'
brew 'htop'
brew 'java'
brew 'jmeter'
brew 'jq'
brew 'jsonnet'
brew 'krew'
brew 'netcat'
brew 'neovim'
brew 'nginx'
brew 'node'
brew 'nodeenv'
brew 'nvm'
brew 'pipenv'
brew 'postgresql@15'
brew 'postgis'
brew 'prettyping'
brew 'pstree'
brew 'python-yq'
brew 'rbenv'
brew 'socat'
brew 'skaffold'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'watch'
brew 'youtube-dl'
brew 'ytt'
brew 'zsh'
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'butler'
cask 'caffeine'
cask 'charles'
cask 'chromium'
cask 'deluge'
cask 'discord'
cask 'docker'
cask 'dotnet-sdk'
cask 'dropbox'
cask 'expressvpn'
cask 'firefox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive-file-stream'
cask 'handbrake'
cask 'intellij-idea'
cask 'iterm2'
cask 'itsycal'
cask 'karabiner-elements'
cask 'keybase'
cask 'little-snitch'
cask 'loopback'
cask 'macdown'
cask 'mactracker'
cask 'monolingual'
cask 'netspot'
cask 'omnidisksweeper'
cask 'omnigraffle'
cask 'qgis'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'
cask 'witch'

## VMWare packages
brew 'certstrap'
brew 'kind'
brew 'kubernetes-cli'
brew 'lastpass-cli'
brew 'openssl'
brew 'prettier'
brew 'shellcheck'
brew 'terraform'
brew 'wireguard-tools'
brew 'yamllint'
brew 'yarn'
cask 'aws-vault'
