tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'caskroom/versions'
tap 'heroku/brew'

cask '1password'
cask 'across-lite'
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'caffeine'
cask 'charles'
cask 'dash'
cask 'docker'
cask 'dotnet-sdk'
cask 'dropbox'
cask 'expressvpn'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'insomnia'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'itsycal'
cask 'java'
cask 'java8'
cask 'karabiner-elements'
cask 'keybase'
cask 'little-snitch'
cask 'loopback'
cask 'macdown'
cask 'mactracker'
cask 'microsoft-office'
cask 'monolingual'
cask 'mono-mdk', link: false
cask 'mysqlworkbench'
cask 'netspot'
cask 'obs'
cask 'omnidisksweeper'
cask 'omnifocus'
cask 'omnigraffle'
cask 'paw'
cask 'postman'
cask 'rider'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sqlpro-for-postgres'
cask 'steam'
cask 'tabula'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'
cask 'witch'

brew 'automake'
brew 'awscli'
brew 'cmake'
brew 'coreutils'
brew 'csvkit'
brew 'ctags'
brew 'direnv'
brew 'gdb'
brew 'git'
brew 'git-lfs'
brew 'highlight'
brew 'htop'
brew 'jmeter'
brew 'jq'
brew 'libkml'
brew 'mono'
brew 'mycli'
brew 'neovim'
brew 'nginx'
brew 'node'
brew 'nodeenv'
brew 'nuget'
brew 'pipenv'
brew 'postgresql'
brew 'prettyping'
brew 'pstree'
brew 'rbenv'
brew 'rustup-init'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'watch'
brew 'youtube-dl'
brew 'zsh'

brew 'heroku/brew/heroku'

if ENV.has_key?('SG_ENV')
  brew 'mysql'
  brew 'mysql-client'
  brew 'mysql-connector-c'
  brew 'rabbitmq'
  brew 'vault'
  brew 'yarn'
  cask 'cloudapp'
  cask 'datagrip'
  cask 'google-drive-file-stream'
  cask 'pritunl'
  cask 'vagrant'
else
  tap 'osgeo/osgeo4mac'

  brew 'osgeo/osgeo4mac/osgeo-qgis'
  cask 'blender'
  cask 'calibre'
end
